{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activation": "relu", "nb_col": 3, "nb_row": 3, "activity_regularizer": null, "batch_input_shape": [null, 3, 32, 32], "b_constraint": null, "trainable": true, "W_regularizer": null, "bias": true, "border_mode": "same", "nb_filter": 16, "subsample": [1, 1], "input_dtype": "float32", "dim_ordering": "th", "W_constraint": null, "name": "convolution2d_1", "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "th", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "nb_col": 3, "nb_row": 3, "activity_regularizer": null, "name": "convolution2d_2", "b_constraint": null, "trainable": true, "W_regularizer": null, "bias": true, "border_mode": "same", "nb_filter": 16, "subsample": [1, 1], "dim_ordering": "th", "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_2", "dim_ordering": "th", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "input_dim": null, "name": "dense_1", "b_constraint": null, "trainable": true, "W_regularizer": null, "bias": true, "output_dim": 20, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"activation": "softmax", "activity_regularizer": null, "input_dim": null, "name": "dense_2", "b_constraint": null, "trainable": true, "W_regularizer": null, "bias": true, "output_dim": 10, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform"}}], "keras_version": "1.1.1"}