{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "batch_input_shape": [null, 3, 32, 32], "nb_col": 3, "activation": "relu", "dim_ordering": "th", "activity_regularizer": null, "bias": true, "subsample": [1, 1], "input_dtype": "float32", "nb_filter": 16, "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_1", "border_mode": "same", "nb_row": 3, "trainable": true, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "dim_ordering": "th", "activity_regularizer": null, "b_regularizer": null, "nb_filter": 512, "W_regularizer": null, "subsample": [1, 1], "name": "convolution2d_2", "border_mode": "same", "nb_row": 3, "trainable": true, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "bias": true, "activation": "relu", "activity_regularizer": null, "input_dim": null, "output_dim": 20, "W_regularizer": null, "b_regularizer": null, "name": "dense_1", "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "bias": true, "activation": "softmax", "activity_regularizer": null, "input_dim": null, "output_dim": 10, "W_regularizer": null, "b_regularizer": null, "name": "dense_2", "trainable": true, "b_constraint": null}}]}