{"keras_version": "1.1.1", "config": [{"config": {"nb_row": 3, "dim_ordering": "th", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "convolution2d_1", "bias": true, "border_mode": "same", "W_regularizer": null, "nb_filter": 16, "trainable": true, "activation": "relu", "init": "glorot_uniform", "batch_input_shape": [null, 3, 32, 32], "input_dtype": "float32", "subsample": [1, 1], "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "trainable": true, "strides": [4, 4], "pool_size": [4, 4], "dim_ordering": "th", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "dim_ordering": "th", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "name": "convolution2d_2", "bias": true, "border_mode": "same", "W_regularizer": null, "nb_filter": 512, "trainable": true, "activation": "relu", "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "trainable": true, "strides": [4, 4], "pool_size": [4, 4], "dim_ordering": "th", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "name": "dense_1", "output_dim": 20, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"input_dim": null, "name": "dense_2", "output_dim": 10, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}