{"keras_version": "1.1.1", "config": [{"config": {"nb_row": 3, "bias": true, "W_regularizer": null, "border_mode": "same", "subsample": [1, 1], "batch_input_shape": [null, 3, 32, 32], "input_dtype": "float32", "trainable": true, "b_constraint": null, "nb_col": 3, "name": "convolution2d_1", "nb_filter": 32, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "th", "activation": "relu", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "dim_ordering": "th", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_row": 3, "W_regularizer": null, "border_mode": "same", "bias": true, "subsample": [1, 1], "b_constraint": null, "nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 32, "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "dim_ordering": "th", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "name": "dense_1", "trainable": true, "output_dim": 20, "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "name": "dense_2", "trainable": true, "output_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "activation": "softmax", "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential"}