{"config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 5, "W_constraint": null, "input_dtype": "float32", "activation": "relu", "batch_input_shape": [null, 3, 32, 32], "bias": true, "name": "convolution2d_1", "b_constraint": null, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "th", "nb_row": 5, "W_regularizer": null, "trainable": true, "nb_filter": 16}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "th", "border_mode": "valid", "strides": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 5, "W_constraint": null, "activation": "relu", "bias": true, "name": "convolution2d_2", "b_constraint": null, "activity_regularizer": null, "border_mode": "same", "dim_ordering": "th", "nb_row": 5, "W_regularizer": null, "trainable": true, "nb_filter": 512}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "th", "border_mode": "valid", "strides": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "input_dim": null, "activity_regularizer": null, "name": "dense_1", "b_constraint": null, "activation": "relu", "output_dim": 20, "W_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "input_dim": null, "activity_regularizer": null, "name": "dense_2", "b_constraint": null, "activation": "softmax", "output_dim": 10, "W_regularizer": null, "trainable": true}}], "keras_version": "1.1.1", "class_name": "Sequential"}