{"config": [{"config": {"input_dtype": "float32", "activation": "relu", "b_regularizer": null, "trainable": true, "dim_ordering": "th", "activity_regularizer": null, "name": "convolution2d_1", "b_constraint": null, "nb_row": 5, "border_mode": "same", "bias": true, "batch_input_shape": [null, 3, 32, 32], "nb_filter": 16, "W_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "strides": [4, 4], "name": "maxpooling2d_1", "pool_size": [4, 4], "dim_ordering": "th", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "border_mode": "same", "b_regularizer": null, "dim_ordering": "th", "activity_regularizer": null, "name": "convolution2d_2", "b_constraint": null, "nb_row": 5, "nb_col": 5, "bias": true, "nb_filter": 512, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "subsample": [1, 1], "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "strides": [4, 4], "name": "maxpooling2d_2", "pool_size": [4, 4], "dim_ordering": "th", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "dense_1", "b_constraint": null, "bias": true, "input_dim": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "output_dim": 20}, "class_name": "Dense"}, {"config": {"activation": "softmax", "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "name": "dense_2", "b_constraint": null, "bias": true, "input_dim": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "output_dim": 10}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}