{"config": [{"config": {"W_constraint": null, "init": "glorot_uniform", "border_mode": "same", "input_dtype": "float32", "nb_row": 3, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_1", "b_constraint": null, "b_regularizer": null, "batch_input_shape": [null, 3, 32, 32], "subsample": [1, 1], "bias": true, "nb_col": 3, "dim_ordering": "th", "nb_filter": 64, "trainable": true, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "border_mode": "same", "nb_row": 3, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_2", "b_constraint": null, "b_regularizer": null, "subsample": [1, 1], "bias": true, "nb_col": 3, "dim_ordering": "th", "nb_filter": 64, "trainable": true, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "name": "dense_1", "output_dim": 20, "b_constraint": null, "b_regularizer": null, "bias": true, "trainable": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "name": "dense_2", "output_dim": 10, "b_constraint": null, "b_regularizer": null, "bias": true, "trainable": true, "activation": "softmax"}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}