{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "th", "bias": true, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "input_dtype": "float32", "nb_row": 7, "nb_filter": 16, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "convolution2d_1", "init": "glorot_uniform", "subsample": [1, 1], "nb_col": 7, "trainable": true, "border_mode": "same", "batch_input_shape": [null, 3, 32, 32]}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "th", "bias": true, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "nb_row": 7, "nb_filter": 512, "b_regularizer": null, "b_constraint": null, "nb_col": 7, "name": "convolution2d_2", "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "border_mode": "same", "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "activation": "relu", "output_dim": 20, "name": "dense_1", "input_dim": null, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "activation": "softmax", "output_dim": 10, "name": "dense_2", "input_dim": null, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform"}}]}