{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [null, 3, 32, 32], "name": "convolution2d_1", "border_mode": "same", "W_constraint": null, "trainable": true, "nb_row": 7, "dim_ordering": "th", "activity_regularizer": null, "nb_filter": 16, "W_regularizer": null, "bias": true, "b_constraint": null, "nb_col": 7, "input_dtype": "float32", "subsample": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "strides": [4, 4], "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "pool_size": [4, 4]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "convolution2d_2", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "nb_row": 7, "dim_ordering": "th", "activity_regularizer": null, "nb_filter": 512, "W_regularizer": null, "bias": true, "b_constraint": null, "nb_col": 7, "trainable": true, "b_regularizer": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "strides": [4, 4], "name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "pool_size": [4, 4]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 20, "name": "dense_1", "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "b_constraint": null, "input_dim": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 10, "name": "dense_2", "W_constraint": null, "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "bias": true, "b_constraint": null, "input_dim": null, "activation": "softmax"}}], "keras_version": "1.1.1"}