{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "convolution2d_1", "activity_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 3, 32, 32], "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "subsample": [1, 1], "nb_row": 9, "nb_col": 9, "trainable": true, "input_dtype": "float32", "W_constraint": null, "bias": true, "W_regularizer": null, "border_mode": "same", "nb_filter": 16}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true, "dim_ordering": "th", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "name": "convolution2d_2", "activity_regularizer": null, "b_constraint": null, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "nb_col": 9, "subsample": [1, 1], "nb_row": 9, "nb_filter": 512, "trainable": true, "W_constraint": null, "bias": true, "W_regularizer": null, "border_mode": "same"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true, "dim_ordering": "th", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_1", "activation": "relu", "activity_regularizer": null, "output_dim": 20, "trainable": true, "b_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null, "bias": true, "W_regularizer": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_2", "activation": "softmax", "activity_regularizer": null, "output_dim": 10, "trainable": true, "b_regularizer": null, "b_constraint": null, "input_dim": null, "W_constraint": null, "bias": true, "W_regularizer": null}}], "keras_version": "1.1.1"}