{"config": [{"config": {"init": "glorot_uniform", "b_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "same", "input_dtype": "float32", "batch_input_shape": [null, 3, 32, 32], "bias": true, "nb_row": 9, "dim_ordering": "th", "trainable": true, "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_1", "nb_filter": 16, "W_regularizer": null, "nb_col": 9, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [4, 4], "trainable": true, "dim_ordering": "th", "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "b_regularizer": null, "activation": "relu", "b_constraint": null, "border_mode": "same", "bias": true, "nb_row": 9, "dim_ordering": "th", "trainable": true, "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_2", "nb_filter": 512, "W_regularizer": null, "nb_col": 9, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [4, 4], "trainable": true, "dim_ordering": "th", "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 20, "b_regularizer": null, "b_constraint": null, "bias": true, "activation": "relu", "trainable": true, "W_constraint": null, "input_dim": null, "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"output_dim": 10, "b_regularizer": null, "b_constraint": null, "bias": true, "activation": "softmax", "trainable": true, "W_constraint": null, "input_dim": null, "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}