{"config": [{"class_name": "Convolution2D", "config": {"nb_col": 5, "trainable": true, "batch_input_shape": [null, 3, 32, 32], "bias": true, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_1", "dim_ordering": "th", "input_dtype": "float32", "border_mode": "same", "nb_row": 5, "nb_filter": 16}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "dim_ordering": "th", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 7, "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "subsample": [1, 1], "activity_regularizer": null, "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "W_regularizer": null, "name": "convolution2d_2", "dim_ordering": "th", "border_mode": "same", "nb_row": 7, "nb_filter": 512}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "dim_ordering": "th", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "output_dim": 100, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_1", "W_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_2", "W_constraint": null, "activation": "softmax"}}], "keras_version": "1.1.1", "class_name": "Sequential"}