{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "b_constraint": null, "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "input_dtype": "float32", "batch_input_shape": [null, 3, 32, 32], "activation": "relu", "dim_ordering": "th", "nb_col": 5, "nb_row": 5, "nb_filter": 16, "W_regularizer": null, "trainable": true, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "th", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "border_mode": "same", "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "nb_row": 7, "nb_filter": 512, "W_regularizer": null, "nb_col": 7, "bias": true, "b_constraint": null, "trainable": true, "dim_ordering": "th"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "th", "border_mode": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 20, "activation": "relu", "W_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 10, "activation": "softmax", "W_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": null, "bias": true}}]}