{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 16, "name": "convolution2d_1", "activation": "relu", "trainable": true, "W_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "input_dtype": "float32", "border_mode": "same", "W_constraint": null, "nb_row": 5, "batch_input_shape": [null, 3, 32, 32], "dim_ordering": "th", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "nb_filter": 512, "name": "convolution2d_2", "activation": "relu", "trainable": true, "W_regularizer": null, "nb_col": 7, "init": "glorot_uniform", "nb_row": 7, "border_mode": "same", "W_constraint": null, "activity_regularizer": null, "dim_ordering": "th", "b_regularizer": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "th", "name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "activation": "relu", "W_regularizer": null, "trainable": true, "output_dim": 200, "W_constraint": null, "input_dim": null, "name": "dense_1", "b_regularizer": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "activation": "softmax", "W_regularizer": null, "trainable": true, "output_dim": 10, "W_constraint": null, "input_dim": null, "name": "dense_2", "b_regularizer": null, "activity_regularizer": null, "bias": true}}]}