{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_1", "subsample": [1, 1], "batch_input_shape": [null, 3, 32, 32], "W_constraint": null, "border_mode": "same", "activation": "relu", "init": "glorot_uniform", "nb_row": 5, "input_dtype": "float32", "trainable": true, "nb_filter": 16, "nb_col": 5, "b_regularizer": null, "bias": true, "activity_regularizer": null, "dim_ordering": "th", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "th", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_2", "bias": true, "W_constraint": null, "subsample": [1, 1], "border_mode": "same", "activation": "relu", "init": "glorot_uniform", "nb_row": 7, "trainable": true, "nb_filter": 512, "nb_col": 7, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "th", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_1", "trainable": true, "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "input_dim": null, "activity_regularizer": null, "output_dim": 50, "W_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_2", "trainable": true, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "input_dim": null, "activity_regularizer": null, "output_dim": 10, "W_regularizer": null}}]}