{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_filter": 16, "nb_col": 5, "trainable": true, "input_dtype": "float32", "W_regularizer": null, "nb_row": 5, "name": "convolution2d_1", "b_constraint": null, "activity_regularizer": null, "dim_ordering": "th", "batch_input_shape": [null, 3, 32, 32], "activation": "relu", "bias": true, "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "th", "trainable": true, "name": "maxpooling2d_1", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "nb_filter": 512, "nb_col": 7, "trainable": true, "W_regularizer": null, "nb_row": 7, "name": "convolution2d_2", "b_constraint": null, "bias": true, "activity_regularizer": null, "dim_ordering": "th", "border_mode": "same", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "th", "trainable": true, "name": "maxpooling2d_2", "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 20, "trainable": true, "W_regularizer": null, "W_constraint": null, "name": "dense_1", "activity_regularizer": null, "b_constraint": null, "activation": "relu", "bias": true, "input_dim": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 10, "trainable": true, "W_regularizer": null, "W_constraint": null, "name": "dense_2", "activity_regularizer": null, "b_constraint": null, "activation": "softmax", "bias": true, "input_dim": null, "init": "glorot_uniform"}}]}