{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 3, "batch_input_shape": [null, 3, 32, 32], "W_constraint": null, "trainable": true, "nb_col": 3, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "nb_filter": 32, "name": "convolution2d_1", "activation": "relu", "W_regularizer": null, "dim_ordering": "th", "input_dtype": "float32", "subsample": [1, 1], "b_constraint": null, "border_mode": "same"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 3, "nb_filter": 32, "W_constraint": null, "trainable": true, "nb_col": 3, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "convolution2d_2", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "th", "activation": "relu", "b_constraint": null, "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 3, "nb_filter": 256, "W_constraint": null, "trainable": true, "nb_col": 3, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "convolution2d_3", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "th", "activation": "relu", "b_constraint": null, "border_mode": "same"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_row": 3, "nb_filter": 256, "W_constraint": null, "trainable": true, "nb_col": 3, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "name": "convolution2d_4", "subsample": [1, 1], "W_regularizer": null, "dim_ordering": "th", "activation": "relu", "b_constraint": null, "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "th", "border_mode": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_1", "activation": "relu", "W_regularizer": null, "output_dim": 20, "b_constraint": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": null, "bias": true, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "name": "dense_2", "activation": "softmax", "W_regularizer": null, "output_dim": 10, "b_constraint": null, "trainable": true}}]}