{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "activation": "relu", "activity_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 3, 32, 32], "b_constraint": null, "nb_row": 3, "name": "convolution2d_1", "nb_col": 3, "b_regularizer": null, "input_dtype": "float32", "nb_filter": 32, "W_regularizer": null, "border_mode": "same", "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "activation": "relu", "name": "convolution2d_2", "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "border_mode": "valid", "nb_col": 3, "b_regularizer": null, "nb_filter": 32, "W_regularizer": null, "W_constraint": null, "dim_ordering": "th"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "activation": "relu", "name": "convolution2d_3", "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "border_mode": "same", "nb_col": 3, "b_regularizer": null, "nb_filter": 256, "W_regularizer": null, "W_constraint": null, "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "activation": "relu", "name": "convolution2d_4", "activity_regularizer": null, "b_constraint": null, "nb_row": 3, "border_mode": "valid", "nb_col": 3, "b_regularizer": null, "nb_filter": 256, "W_regularizer": null, "W_constraint": null, "dim_ordering": "th"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "init": "glorot_uniform", "activation": "relu", "name": "dense_1", "activity_regularizer": null, "b_constraint": null, "output_dim": 20, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "init": "glorot_uniform", "activation": "softmax", "name": "dense_2", "activity_regularizer": null, "b_constraint": null, "output_dim": 10, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null}}], "keras_version": "1.1.1"}