{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_filter": 32, "name": "convolution2d_1", "border_mode": "same", "trainable": true, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 3, 32, 32], "bias": true, "input_dtype": "float32", "nb_row": 3, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "b_constraint": null, "activation": "relu", "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "name": "convolution2d_2", "border_mode": "valid", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "nb_row": 3, "W_constraint": null, "b_constraint": null, "bias": true, "nb_col": 3, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 256, "name": "convolution2d_3", "border_mode": "same", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "nb_row": 3, "W_constraint": null, "b_constraint": null, "bias": true, "nb_col": 3, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_filter": 256, "name": "convolution2d_4", "border_mode": "valid", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "nb_row": 3, "W_constraint": null, "b_constraint": null, "bias": true, "nb_col": 3, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "activation": "relu", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "W_constraint": null, "output_dim": 20}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "activation": "softmax", "W_constraint": null, "output_dim": 10}}]}