{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activation": "relu", "nb_row": 8, "input_dtype": "float32", "trainable": true, "activity_regularizer": null, "nb_filter": 32, "nb_col": 8, "name": "convolution2d_1", "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "batch_input_shape": [null, 3, 32, 32], "b_constraint": null, "dim_ordering": "th", "W_constraint": null, "border_mode": "same"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "nb_row": 8, "W_constraint": null, "trainable": true, "activity_regularizer": null, "nb_filter": 256, "nb_col": 8, "name": "convolution2d_2", "init": "glorot_uniform", "subsample": [1, 1], "bias": true, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "dim_ordering": "th", "border_mode": "same"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_2", "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "output_dim": 20, "trainable": true, "activity_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "bias": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "output_dim": 10, "trainable": true, "activity_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "bias": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "W_constraint": null}}], "keras_version": "1.1.1"}