{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activation": "relu", "b_constraint": null, "trainable": true, "init": "glorot_uniform", "batch_input_shape": [null, 3, 32, 32], "bias": true, "name": "convolution2d_1", "subsample": [1, 1], "input_dtype": "float32", "nb_col": 4, "nb_filter": 32, "b_regularizer": null, "border_mode": "same", "W_regularizer": null, "activity_regularizer": null, "nb_row": 4, "W_constraint": null, "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "convolution2d_2", "subsample": [1, 1], "nb_col": 4, "W_constraint": null, "nb_filter": 32, "border_mode": "valid", "activity_regularizer": null, "nb_row": 4, "trainable": true, "dim_ordering": "th"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "convolution2d_3", "subsample": [1, 1], "nb_col": 4, "W_constraint": null, "nb_filter": 256, "border_mode": "same", "activity_regularizer": null, "nb_row": 4, "trainable": true, "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "b_constraint": null, "activation": "relu", "b_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "convolution2d_4", "subsample": [1, 1], "nb_col": 4, "W_constraint": null, "nb_filter": 256, "border_mode": "valid", "activity_regularizer": null, "nb_row": 4, "trainable": true, "dim_ordering": "th"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "th"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "W_regularizer": null, "name": "dense_1", "W_constraint": null, "output_dim": 20, "activity_regularizer": null, "trainable": true, "input_dim": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null, "bias": true, "W_regularizer": null, "name": "dense_2", "W_constraint": null, "output_dim": 10, "activity_regularizer": null, "trainable": true, "input_dim": null}}]}