{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 2, "name": "convolution2d_1", "batch_input_shape": [null, 3, 32, 32], "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "nb_filter": 32, "input_dtype": "float32", "subsample": [1, 1], "W_regularizer": null, "nb_row": 2, "activity_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 2, "name": "convolution2d_2", "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "nb_filter": 32, "subsample": [1, 1], "W_regularizer": null, "nb_row": 2, "activity_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 2, "name": "convolution2d_3", "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "nb_filter": 32, "subsample": [1, 1], "W_regularizer": null, "nb_row": 2, "activity_regularizer": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 2, "name": "convolution2d_4", "init": "glorot_uniform", "W_constraint": null, "border_mode": "same", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1], "W_regularizer": null, "nb_row": 2, "activity_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 2, "name": "convolution2d_5", "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1], "W_regularizer": null, "nb_row": 2, "activity_regularizer": null, "bias": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 2, "name": "convolution2d_6", "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "trainable": true, "b_constraint": null, "dim_ordering": "th", "activation": "relu", "b_regularizer": null, "nb_filter": 256, "subsample": [1, 1], "W_regularizer": null, "nb_row": 2, "activity_regularizer": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "init": "glorot_uniform", "W_constraint": null, "output_dim": 20, "trainable": true, "b_constraint": null, "activation": "relu", "b_regularizer": null, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "init": "glorot_uniform", "W_constraint": null, "output_dim": 10, "trainable": true, "b_constraint": null, "activation": "softmax", "b_regularizer": null, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "bias": true}}], "keras_version": "1.1.1"}