{"config": [{"class_name": "Embedding", "config": {"W_constraint": null, "input_length": 500, "input_dim": 3000, "output_dim": 16, "mask_zero": false, "batch_input_shape": [null, 500], "name": "embedding_1", "init": "uniform", "W_regularizer": null, "trainable": true, "input_dtype": "int32", "activity_regularizer": null, "dropout": 0.0}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"activation": "tanh", "dropout_W": 0.0, "U_regularizer": null, "input_length": null, "input_dim": 16, "output_dim": 100, "go_backwards": false, "consume_less": "cpu", "dropout_U": 0.0, "return_sequences": false, "stateful": false, "b_regularizer": null, "name": "lstm_1", "unroll": false, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal", "forget_bias_init": "one"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "input_dim": null, "output_dim": 1, "name": "dense_1", "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true}}], "keras_version": "1.1.1", "class_name": "Sequential"}