{"config": [{"config": {"name": "embedding_2", "dropout": 0.0, "input_length": 500, "input_dim": 10000, "output_dim": 16, "trainable": true, "init": "uniform", "mask_zero": false, "W_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 500], "input_dtype": "int32", "W_constraint": null}, "class_name": "Embedding"}, {"config": {"name": "lstm_2", "consume_less": "cpu", "return_sequences": false, "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "input_dim": 16, "init": "glorot_uniform", "trainable": true, "activation": "tanh", "dropout_U": 0.0, "go_backwards": false, "dropout_W": 0.0, "output_dim": 100, "W_regularizer": null, "input_length": null, "forget_bias_init": "one", "stateful": false, "unroll": false, "U_regularizer": null, "b_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dense_2", "input_dim": null, "init": "glorot_uniform", "trainable": true, "activation": "sigmoid", "output_dim": 1, "bias": true, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}