{"keras_version": "1.1.1", "config": [{"config": {"name": "embedding_1", "input_length": 500, "input_dtype": "int32", "output_dim": 16, "dropout": 0.0, "mask_zero": false, "activity_regularizer": null, "trainable": true, "W_constraint": null, "input_dim": 3000, "init": "uniform", "batch_input_shape": [null, 500], "W_regularizer": null}, "class_name": "Embedding"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"stateful": false, "go_backwards": false, "consume_less": "cpu", "inner_init": "orthogonal", "U_regularizer": null, "forget_bias_init": "one", "name": "lstm_1", "inner_activation": "hard_sigmoid", "activation": "tanh", "input_dim": 16, "unroll": false, "init": "glorot_uniform", "input_length": null, "dropout_W": 0.0, "W_regularizer": null, "dropout_U": 0.0, "output_dim": 300, "trainable": true, "return_sequences": false, "b_regularizer": null}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "b_constraint": null, "b_regularizer": null, "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "sigmoid", "input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}