{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Embedding", "config": {"output_dim": 16, "input_dim": 3000, "init": "uniform", "input_length": 500, "W_regularizer": null, "mask_zero": false, "dropout": 0.0, "trainable": true, "activity_regularizer": null, "batch_input_shape": [null, 500], "name": "embedding_1", "input_dtype": "int32", "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"output_dim": 100, "input_dim": 16, "init": "glorot_uniform", "input_length": null, "name": "lstm_1", "stateful": false, "W_regularizer": null, "forget_bias_init": "one", "consume_less": "cpu", "return_sequences": false, "dropout_W": 0.0, "trainable": true, "activation": "tanh", "dropout_U": 0.0, "unroll": false, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal", "go_backwards": false, "U_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"output_dim": 1, "input_dim": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "sigmoid", "name": "dense_1", "b_constraint": null, "W_constraint": null, "b_regularizer": null}}]}