{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 3000, "input_length": 500, "W_regularizer": null, "trainable": true, "output_dim": 16, "activity_regularizer": null, "batch_input_shape": [null, 500], "mask_zero": false, "input_dtype": "int32", "W_constraint": null, "dropout": 0.0, "name": "embedding_1", "init": "uniform"}}, {"class_name": "LSTM", "config": {"input_dim": 16, "input_length": null, "stateful": false, "trainable": true, "output_dim": 100, "U_regularizer": null, "consume_less": "cpu", "go_backwards": false, "inner_activation": "hard_sigmoid", "b_regularizer": null, "inner_init": "orthogonal", "forget_bias_init": "one", "dropout_U": 0.0, "name": "lstm_1", "dropout_W": 0.0, "unroll": false, "return_sequences": true, "activation": "tanh", "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "LSTM", "config": {"input_dim": 100, "input_length": null, "stateful": false, "trainable": true, "output_dim": 50, "U_regularizer": null, "consume_less": "cpu", "go_backwards": false, "inner_activation": "hard_sigmoid", "b_regularizer": null, "inner_init": "orthogonal", "forget_bias_init": "one", "dropout_U": 0.0, "name": "lstm_2", "dropout_W": 0.0, "unroll": false, "return_sequences": false, "activation": "tanh", "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Dense", "config": {"input_dim": null, "W_regularizer": null, "trainable": true, "output_dim": 1, "activity_regularizer": null, "b_regularizer": null, "bias": true, "W_constraint": null, "b_constraint": null, "name": "dense_1", "activation": "sigmoid", "init": "glorot_uniform"}}], "keras_version": "1.1.1"}