{"config": [{"config": {"init": "uniform", "activity_regularizer": null, "input_dtype": "int32", "input_dim": 3000, "name": "embedding_1", "trainable": true, "W_regularizer": null, "dropout": 0.0, "mask_zero": false, "input_length": 500, "batch_input_shape": [null, 500], "output_dim": 16, "W_constraint": null}, "class_name": "Embedding"}, {"config": {"init": "uniform", "filter_length": 3, "input_dim": null, "bias": true, "activation": "relu", "name": "convolution1d_1", "trainable": true, "border_mode": "same", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "input_length": null, "nb_filter": 32, "W_regularizer": null, "subsample_length": 1, "W_constraint": null}, "class_name": "Convolution1D"}, {"config": {"stride": 2, "name": "maxpooling1d_1", "trainable": true, "border_mode": "valid", "pool_length": 2}, "class_name": "MaxPooling1D"}, {"config": {"forget_bias_init": "one", "init": "glorot_uniform", "consume_less": "cpu", "output_dim": 100, "return_sequences": false, "go_backwards": false, "activation": "tanh", "name": "lstm_1", "trainable": true, "W_regularizer": null, "b_regularizer": null, "U_regularizer": null, "inner_activation": "hard_sigmoid", "dropout_U": 0.0, "inner_init": "orthogonal", "input_length": null, "dropout_W": 0.0, "unroll": false, "input_dim": 32, "stateful": false}, "class_name": "LSTM"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1, "input_dim": null, "bias": true, "activation": "sigmoid", "name": "dense_1", "trainable": true, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}