{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "W_constraint": null, "init": "uniform", "mask_zero": false, "W_regularizer": null, "dropout": 0.0, "input_dim": 3000, "activity_regularizer": null, "output_dim": 16, "trainable": true, "input_length": 500, "input_dtype": "int32", "batch_input_shape": [null, 500]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "LSTM", "config": {"unroll": false, "name": "lstm_1", "stateful": false, "input_length": null, "consume_less": "cpu", "init": "glorot_uniform", "dropout_U": 0.0, "W_regularizer": null, "return_sequences": false, "activation": "tanh", "input_dim": 16, "go_backwards": false, "U_regularizer": null, "output_dim": 100, "dropout_W": 0.0, "trainable": true, "forget_bias_init": "one", "b_regularizer": null, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}}, {"class_name": "Dense", "config": {"name": "dense_1", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "activation": "sigmoid", "input_dim": null, "activity_regularizer": null, "bias": true, "output_dim": 1, "trainable": true, "b_regularizer": null, "W_constraint": null}}]}