{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dtype": "int32", "W_constraint": null, "dropout": 0.0, "W_regularizer": null, "name": "embedding_1", "mask_zero": false, "trainable": true, "init": "uniform", "batch_input_shape": [null, 500], "activity_regularizer": null, "input_length": 500, "input_dim": 3000, "output_dim": 16}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "relu", "name": "dense_1", "b_regularizer": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "output_dim": 64, "bias": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "relu", "name": "dense_2", "b_regularizer": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "output_dim": 32, "bias": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "sigmoid", "name": "dense_3", "b_regularizer": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "output_dim": 1, "bias": true}}], "keras_version": "1.1.1"}