{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 500, "input_dim": 3000, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dtype": "int32", "mask_zero": false, "batch_input_shape": [null, 500], "output_dim": 16, "dropout": 0.0, "init": "uniform", "name": "embedding_1", "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "bias": true, "input_dim": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "output_dim": 64, "init": "glorot_uniform", "name": "dense_1", "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activation": "relu", "bias": true, "input_dim": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "output_dim": 32, "init": "glorot_uniform", "name": "dense_2", "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "bias": true, "input_dim": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "output_dim": 1, "init": "glorot_uniform", "name": "dense_3", "W_constraint": null}}], "keras_version": "1.1.1"}