{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"trainable": true, "init": "uniform", "W_regularizer": null, "output_dim": 16, "name": "embedding_1", "activity_regularizer": null, "input_dtype": "int32", "mask_zero": false, "W_constraint": null, "input_length": 500, "input_dim": 3000, "batch_input_shape": [null, 500], "dropout": 0.0}}, {"class_name": "LSTM", "config": {"trainable": true, "init": "glorot_uniform", "go_backwards": false, "inner_activation": "hard_sigmoid", "consume_less": "cpu", "dropout_U": 0.0, "output_dim": 100, "name": "lstm_1", "dropout_W": 0.0, "U_regularizer": null, "input_dim": 16, "b_regularizer": null, "input_length": null, "activation": "tanh", "stateful": false, "inner_init": "orthogonal", "unroll": false, "forget_bias_init": "one", "return_sequences": false, "W_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "bias": true, "output_dim": 1, "b_constraint": null, "activity_regularizer": null, "input_dim": null, "W_constraint": null, "b_regularizer": null, "activation": "sigmoid", "name": "dense_1", "W_regularizer": null}}]}