{"config": [{"config": {"input_length": 500, "name": "embedding_1", "output_dim": 16, "W_constraint": null, "input_dim": 3000, "batch_input_shape": [null, 500], "init": "uniform", "input_dtype": "int32", "activity_regularizer": null, "W_regularizer": null, "mask_zero": false, "dropout": 0.0, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"input_length": null, "name": "lstm_1", "trainable": true, "unroll": false, "dropout_W": 0.0, "output_dim": 100, "forget_bias_init": "one", "go_backwards": false, "activation": "tanh", "consume_less": "cpu", "U_regularizer": null, "dropout_U": 0.0, "stateful": false, "init": "glorot_uniform", "b_regularizer": null, "inner_init": "orthogonal", "W_regularizer": null, "return_sequences": true, "inner_activation": "hard_sigmoid", "input_dim": 16}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"input_length": null, "name": "lstm_2", "trainable": true, "unroll": false, "dropout_W": 0.0, "output_dim": 50, "forget_bias_init": "one", "go_backwards": false, "activation": "tanh", "consume_less": "cpu", "U_regularizer": null, "dropout_U": 0.0, "stateful": false, "init": "glorot_uniform", "b_regularizer": null, "inner_init": "orthogonal", "W_regularizer": null, "return_sequences": false, "inner_activation": "hard_sigmoid", "input_dim": 100}, "class_name": "LSTM"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "output_dim": 1, "bias": true, "activation": "sigmoid", "input_dim": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}