{"config": [{"config": {"trainable": true, "input_dtype": "int32", "input_length": 500, "W_regularizer": null, "batch_input_shape": [null, 500], "name": "embedding_1", "mask_zero": false, "input_dim": 3000, "W_constraint": null, "dropout": 0.0, "activity_regularizer": null, "output_dim": 16, "init": "uniform"}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "trainable": true, "input_length": null, "inner_activation": "hard_sigmoid", "W_regularizer": null, "stateful": false, "name": "lstm_1", "inner_init": "orthogonal", "forget_bias_init": "one", "U_regularizer": null, "dropout_U": 0.0, "input_dim": 16, "return_sequences": false, "go_backwards": false, "activation": "tanh", "unroll": false, "init": "glorot_uniform", "consume_less": "cpu", "dropout_W": 0.0, "output_dim": 500}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "output_dim": 1, "W_regularizer": null, "activation": "sigmoid", "name": "dense_1", "bias": true, "input_dim": null, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}