{"config": [{"config": {"mask_zero": false, "W_constraint": null, "init": "uniform", "W_regularizer": null, "batch_input_shape": [null, 500], "dropout": 0.0, "output_dim": 8, "input_dim": 15000, "name": "embedding_1", "trainable": true, "input_dtype": "int32", "activity_regularizer": null, "input_length": 500}, "class_name": "Embedding"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "inner_activation": "hard_sigmoid", "stateful": false, "U_regularizer": null, "b_regularizer": null, "input_dim": 8, "consume_less": "cpu", "unroll": false, "trainable": true, "dropout_U": 0.0, "name": "lstm_1", "inner_init": "orthogonal", "input_length": null, "dropout_W": 0.0, "activation": "tanh", "go_backwards": false, "return_sequences": false, "forget_bias_init": "one", "output_dim": 100}, "class_name": "LSTM"}, {"config": {"W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "output_dim": 1, "b_regularizer": null, "input_dim": null, "bias": true, "trainable": true, "name": "dense_1", "activation": "sigmoid", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}