{"keras_version": "1.1.1", "config": [{"config": {"W_regularizer": null, "input_length": 500, "dropout": 0.0, "output_dim": 16, "trainable": true, "activity_regularizer": null, "init": "uniform", "name": "embedding_1", "batch_input_shape": [null, 500], "input_dtype": "int32", "mask_zero": false, "W_constraint": null, "input_dim": 3000}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "W_regularizer": null, "activation": "tanh", "inner_activation": "hard_sigmoid", "input_length": null, "unroll": false, "inner_init": "orthogonal", "U_regularizer": null, "output_dim": 400, "go_backwards": false, "input_dim": 16, "init": "glorot_uniform", "name": "lstm_1", "b_regularizer": null, "stateful": false, "dropout_W": 0.0, "return_sequences": false, "dropout_U": 0.0, "forget_bias_init": "one", "consume_less": "cpu"}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "b_regularizer": null, "bias": true, "W_constraint": null, "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential"}