{"config": [{"config": {"batch_input_shape": [null, 500], "W_constraint": null, "mask_zero": false, "input_dtype": "int32", "input_dim": 3000, "activity_regularizer": null, "dropout": 0.0, "trainable": true, "output_dim": 16, "W_regularizer": null, "init": "uniform", "name": "embedding_1", "input_length": 500}, "class_name": "Embedding"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"U_regularizer": null, "inner_init": "orthogonal", "activation": "tanh", "b_regularizer": null, "return_sequences": false, "input_dim": 16, "dropout_U": 0.0, "name": "lstm_1", "consume_less": "cpu", "go_backwards": false, "inner_activation": "hard_sigmoid", "unroll": false, "output_dim": 200, "trainable": true, "dropout_W": 0.0, "W_regularizer": null, "init": "glorot_uniform", "stateful": false, "input_length": null, "forget_bias_init": "one"}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "class_name": "Dropout"}, {"config": {"bias": true, "activation": "sigmoid", "W_constraint": null, "b_regularizer": null, "input_dim": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}