{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_length": 500, "trainable": true, "mask_zero": false, "dropout": 0.0, "input_dtype": "int32", "output_dim": 16, "batch_input_shape": [null, 500], "W_constraint": null, "W_regularizer": null, "init": "uniform", "name": "embedding_1", "input_dim": 3000, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "LSTM", "config": {"input_length": null, "trainable": true, "return_sequences": false, "inner_activation": "hard_sigmoid", "U_regularizer": null, "name": "lstm_1", "forget_bias_init": "one", "stateful": false, "dropout_U": 0.0, "unroll": false, "activation": "tanh", "dropout_W": 0.0, "consume_less": "cpu", "b_regularizer": null, "init": "glorot_uniform", "go_backwards": false, "output_dim": 600, "W_regularizer": null, "input_dim": 16, "inner_init": "orthogonal"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "name": "dense_1", "input_dim": null, "activity_regularizer": null}}], "keras_version": "1.1.1"}