{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 3000, "mask_zero": false, "name": "embedding_1", "activity_regularizer": null, "output_dim": 64, "W_regularizer": null, "trainable": true, "init": "uniform", "W_constraint": null, "input_length": 500, "input_dtype": "int32", "batch_input_shape": [null, 500], "dropout": 0.0}}, {"class_name": "Convolution1D", "config": {"subsample_length": 1, "input_dim": null, "nb_filter": 128, "name": "convolution1d_1", "filter_length": 3, "activity_regularizer": null, "W_regularizer": null, "border_mode": "same", "trainable": true, "bias": true, "init": "uniform", "W_constraint": null, "input_length": null, "b_regularizer": null, "b_constraint": null, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1"}}, {"class_name": "LSTM", "config": {"input_dim": 128, "return_sequences": false, "inner_init": "orthogonal", "name": "lstm_1", "W_regularizer": null, "dropout_U": 0.0, "go_backwards": false, "inner_activation": "hard_sigmoid", "trainable": true, "b_regularizer": null, "U_regularizer": null, "activation": "tanh", "dropout_W": 0.0, "input_length": null, "consume_less": "cpu", "init": "glorot_uniform", "stateful": false, "forget_bias_init": "one", "output_dim": 100, "unroll": false}}, {"class_name": "Dense", "config": {"output_dim": 1, "input_dim": null, "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "trainable": true, "bias": true, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "b_constraint": null, "activation": "sigmoid"}}]}