{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"input_dim": 5000, "output_dim": 32, "dropout": 0.0, "name": "embedding_1", "W_regularizer": null, "init": "uniform", "trainable": true, "input_dtype": "int32", "activity_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 500], "mask_zero": false, "input_length": 500}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": null, "output_dim": 128, "bias": true, "name": "dense_1", "W_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"input_dim": null, "output_dim": 64, "bias": true, "name": "dense_2", "W_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"input_dim": null, "output_dim": 1, "bias": true, "name": "dense_3", "W_regularizer": null, "b_constraint": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "W_constraint": null, "init": "glorot_uniform"}}], "keras_version": "1.1.1"}