{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Embedding", "config": {"trainable": true, "activity_regularizer": null, "input_dtype": "int32", "input_dim": 5000, "mask_zero": false, "dropout": 0.0, "name": "embedding_1", "output_dim": 32, "W_regularizer": null, "init": "uniform", "W_constraint": null, "batch_input_shape": [null, 500], "input_length": 500}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "output_dim": 128, "bias": true, "name": "dense_1", "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "output_dim": 64, "bias": true, "name": "dense_2", "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "output_dim": 1, "bias": true, "name": "dense_3", "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "activation": "sigmoid", "W_constraint": null, "init": "glorot_uniform", "input_dim": null}}]}