{"config": [{"config": {"init": "glorot_uniform", "name": "lstm_1", "dropout_U": 0.0, "forget_bias_init": "one", "input_length": null, "go_backwards": false, "activation": "tanh", "batch_input_shape": [null, null, 3], "output_dim": 4, "consume_less": "cpu", "W_regularizer": null, "inner_init": "orthogonal", "return_sequences": false, "b_regularizer": null, "stateful": false, "inner_activation": "sigmoid", "unroll": false, "input_dtype": "float32", "U_regularizer": null, "trainable": true, "input_dim": 3, "dropout_W": 0.0}, "class_name": "LSTM"}, {"config": {"init": "glorot_uniform", "name": "dense_1", "b_constraint": null, "activation": "linear", "trainable": true, "output_dim": 1, "W_regularizer": null, "W_constraint": null, "bias": true, "input_dim": null, "b_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}