{"config": [{"config": {"trainable": true, "W_regularizer": null, "forget_bias_init": "one", "batch_input_shape": [null, null, 3], "activation": "tanh", "dropout_U": 0.0, "output_dim": 4, "init": "glorot_uniform", "dropout_W": 0.0, "unroll": false, "name": "lstm_1", "inner_init": "orthogonal", "consume_less": "cpu", "U_regularizer": null, "inner_activation": "sigmoid", "input_dtype": "float32", "return_sequences": false, "go_backwards": false, "b_regularizer": null, "input_dim": 3, "input_length": null, "stateful": false}, "class_name": "LSTM"}, {"config": {"output_dim": 1, "trainable": true, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "input_dim": null, "name": "dense_1", "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}