{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"trainable": true, "activation": "tanh", "consume_less": "cpu", "forget_bias_init": "one", "b_regularizer": null, "input_length": null, "name": "lstm_2", "unroll": false, "return_sequences": false, "inner_activation": "sigmoid", "input_dim": 2, "output_dim": 4, "U_regularizer": null, "go_backwards": false, "dropout_U": 0.0, "dropout_W": 0.0, "batch_input_shape": [null, null, 2], "W_regularizer": null, "init": "glorot_uniform", "stateful": false, "input_dtype": "float32", "inner_init": "orthogonal"}}, {"class_name": "Dense", "config": {"output_dim": 1, "trainable": true, "activation": "linear", "b_regularizer": null, "input_dim": null, "name": "dense_2", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_constraint": null}}]}