{"config": [{"config": {"input_length": null, "batch_input_shape": [null, null, 3], "stateful": false, "activation": "tanh", "inner_init": "orthogonal", "input_dtype": "float32", "inner_activation": "hard_sigmoid", "dropout_W": 0.0, "consume_less": "cpu", "input_dim": 3, "output_dim": 4, "trainable": true, "b_regularizer": null, "go_backwards": false, "W_regularizer": null, "name": "gru_1", "return_sequences": false, "unroll": false, "dropout_U": 0.0, "init": "glorot_uniform", "U_regularizer": null}, "class_name": "GRU"}, {"config": {"activation": "linear", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 1, "trainable": true, "name": "dense_2", "b_constraint": null, "W_regularizer": null, "bias": true, "input_dim": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}