{"config": [{"config": {"inner_init": "orthogonal", "input_dtype": "float32", "inner_activation": "sigmoid", "consume_less": "cpu", "return_sequences": false, "trainable": true, "b_regularizer": null, "stateful": false, "input_dim": 3, "U_regularizer": null, "input_length": null, "batch_input_shape": [null, null, 3], "activation": "tanh", "go_backwards": false, "dropout_W": 0.0, "output_dim": 4, "init": "glorot_uniform", "W_regularizer": null, "dropout_U": 0.0, "unroll": false, "forget_bias_init": "one", "name": "lstm_1"}, "class_name": "LSTM"}, {"config": {"activation": "linear", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 1, "trainable": true, "name": "dense_1", "b_constraint": null, "W_regularizer": null, "bias": true, "input_dim": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}