{"config": [{"config": {"input_length": null, "batch_input_shape": [null, null, 3], "stateful": false, "activation": "tanh", "return_sequences": false, "input_dtype": "float32", "name": "simplernn_1", "dropout_W": 0.0, "consume_less": "cpu", "output_dim": 4, "inner_init": "orthogonal", "b_regularizer": null, "go_backwards": false, "W_regularizer": null, "trainable": true, "dropout_U": 0.0, "unroll": false, "input_dim": 3, "init": "glorot_uniform", "U_regularizer": null}, "class_name": "SimpleRNN"}, {"config": {"activation": "linear", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 1, "trainable": true, "name": "dense_3", "b_constraint": null, "W_regularizer": null, "bias": true, "input_dim": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}