{"config": [{"config": {"b_regularizer": null, "dropout_W": 0.0, "init": "glorot_uniform", "input_dim": 1, "W_regularizer": null, "activation": "tanh", "input_dtype": "float32", "forget_bias_init": "one", "batch_input_shape": [null, null, 1], "inner_init": "orthogonal", "trainable": true, "U_regularizer": null, "inner_activation": "sigmoid", "stateful": false, "input_length": null, "output_dim": 4, "consume_less": "cpu", "unroll": false, "go_backwards": false, "dropout_U": 0.0, "name": "lstm_1", "return_sequences": false}, "class_name": "LSTM"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "trainable": true, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "input_dim": null, "b_constraint": null, "bias": true, "W_constraint": null, "name": "dense_1"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}