{"config": [{"config": {"trainable": true, "input_dtype": "float32", "init": "glorot_uniform", "stateful": true, "forget_bias_init": "one", "inner_activation": "hard_sigmoid", "unroll": false, "activation": "tanh", "b_regularizer": null, "U_regularizer": null, "name": "lstm_1", "inner_init": "orthogonal", "dropout_W": 0.0, "output_dim": 4, "go_backwards": false, "return_sequences": false, "batch_input_shape": [1, 3, 1], "dropout_U": 0.0, "consume_less": "cpu", "W_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "init": "glorot_uniform", "bias": true, "output_dim": 1, "input_dim": null, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "b_regularizer": null, "name": "dense_1", "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}