{"config": [{"config": {"inner_init": "orthogonal", "W_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [3, 3, 1], "name": "lstm_1", "dropout_W": 0.0, "input_dtype": "float32", "U_regularizer": null, "inner_activation": "hard_sigmoid", "unroll": false, "activation": "tanh", "return_sequences": false, "consume_less": "cpu", "trainable": true, "b_regularizer": null, "go_backwards": false, "stateful": true, "output_dim": 4, "dropout_U": 0.0, "forget_bias_init": "one"}, "class_name": "LSTM"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "name": "dense_1", "activity_regularizer": null, "b_regularizer": null, "bias": true, "activation": "linear", "trainable": true, "output_dim": 1, "b_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}