{"config": [{"config": {"return_sequences": true, "W_regularizer": null, "input_dtype": "float32", "trainable": true, "go_backwards": false, "consume_less": "cpu", "name": "lstm_1", "dropout_W": 0.0, "output_dim": 4, "dropout_U": 0.0, "batch_input_shape": [1, 3, 1], "inner_activation": "hard_sigmoid", "activation": "tanh", "U_regularizer": null, "stateful": true, "init": "glorot_uniform", "inner_init": "orthogonal", "unroll": false, "b_regularizer": null, "forget_bias_init": "one"}, "class_name": "LSTM"}, {"config": {"return_sequences": false, "W_regularizer": null, "input_dtype": "float32", "trainable": true, "go_backwards": false, "consume_less": "cpu", "name": "lstm_2", "dropout_W": 0.0, "output_dim": 4, "dropout_U": 0.0, "batch_input_shape": [1, 3, 4], "inner_activation": "hard_sigmoid", "activation": "tanh", "U_regularizer": null, "stateful": true, "init": "glorot_uniform", "inner_init": "orthogonal", "unroll": false, "b_regularizer": null, "forget_bias_init": "one"}, "class_name": "LSTM"}, {"config": {"W_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "name": "dense_1", "output_dim": 1, "activation": "linear", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "b_constraint": null, "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}